mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/common/s6e2c1xh.h
              __IO uint8_t IRQ117MONLH;
            };
          };
          union {
            __IO uint16_t IRQ117MONH;
            struct {
              __IO uint8_t IRQ117MONHL;
              __IO uint8_t IRQ117MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ118MON;
        stc_intreq_irq118mon_field_t IRQ118MON_f;
        struct {
          union {
            __IO uint16_t IRQ118MONL;
            struct {
              __IO uint8_t IRQ118MONLL;
              __IO uint8_t IRQ118MONLH;
            };
          };
          union {
            __IO uint16_t IRQ118MONH;
            struct {
              __IO uint8_t IRQ118MONHL;
              __IO uint8_t IRQ118MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ119MON;
        stc_intreq_irq119mon_field_t IRQ119MON_f;
        struct {
          union {
            __IO uint16_t IRQ119MONL;
            struct {
              __IO uint8_t IRQ119MONLL;
              __IO uint8_t IRQ119MONLH;
            };
          };
          union {
            __IO uint16_t IRQ119MONH;
            struct {
              __IO uint8_t IRQ119MONHL;
              __IO uint8_t IRQ119MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ120MON;
        stc_intreq_irq120mon_field_t IRQ120MON_f;
        struct {
          union {
            __IO uint16_t IRQ120MONL;
            struct {
              __IO uint8_t IRQ120MONLL;
              __IO uint8_t IRQ120MONLH;
            };
          };
          union {
            __IO uint16_t IRQ120MONH;
            struct {
              __IO uint8_t IRQ120MONHL;
              __IO uint8_t IRQ120MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ121MON;
        stc_intreq_irq121mon_field_t IRQ121MON_f;
        struct {
          union {
            __IO uint16_t IRQ121MONL;
            struct {
              __IO uint8_t IRQ121MONLL;
              __IO uint8_t IRQ121MONLH;
            };
          };
          union {
            __IO uint16_t IRQ121MONH;
            struct {
              __IO uint8_t IRQ121MONHL;
              __IO uint8_t IRQ121MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ122MON;
        stc_intreq_irq122mon_field_t IRQ122MON_f;
        struct {
          union {
            __IO uint16_t IRQ122MONL;
            struct {
              __IO uint8_t IRQ122MONLL;
              __IO uint8_t IRQ122MONLH;
            };
          };
          union {
            __IO uint16_t IRQ122MONH;
            struct {
              __IO uint8_t IRQ122MONHL;
              __IO uint8_t IRQ122MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ123MON;
        stc_intreq_irq123mon_field_t IRQ123MON_f;
        struct {
          union {
            __IO uint16_t IRQ123MONL;
            struct {
              __IO uint8_t IRQ123MONLL;
              __IO uint8_t IRQ123MONLH;
            };
          };
          union {
            __IO uint16_t IRQ123MONH;
            struct {
              __IO uint8_t IRQ123MONHL;
              __IO uint8_t IRQ123MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ124MON;
        stc_intreq_irq124mon_field_t IRQ124MON_f;
        struct {
          union {
            __IO uint16_t IRQ124MONL;
            struct {
              __IO uint8_t IRQ124MONLL;
              __IO uint8_t IRQ124MONLH;
            };
          };
          union {
            __IO uint16_t IRQ124MONH;
            struct {
              __IO uint8_t IRQ124MONHL;
              __IO uint8_t IRQ124MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ125MON;
        stc_intreq_irq125mon_field_t IRQ125MON_f;
        struct {
          union {
            __IO uint16_t IRQ125MONL;
            struct {
              __IO uint8_t IRQ125MONLL;
              __IO uint8_t IRQ125MONLH;
            };
          };
          union {
            __IO uint16_t IRQ125MONH;
            struct {
              __IO uint8_t IRQ125MONHL;
              __IO uint8_t IRQ125MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ126MON;
        stc_intreq_irq126mon_field_t IRQ126MON_f;
        struct {
          union {
            __IO uint16_t IRQ126MONL;
            struct {
              __IO uint8_t IRQ126MONLL;
              __IO uint8_t IRQ126MONLH;
            };
          };
          union {
            __IO uint16_t IRQ126MONH;
            struct {
              __IO uint8_t IRQ126MONHL;
              __IO uint8_t IRQ126MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ127MON;
        stc_intreq_irq127mon_field_t IRQ127MON_f;
        struct {
          union {
            __IO uint16_t IRQ127MONL;
            struct {
              __IO uint8_t IRQ127MONLL;
              __IO uint8_t IRQ127MONLH;
            };
          };
          union {
            __IO uint16_t IRQ127MONH;
            struct {
              __IO uint8_t IRQ127MONHL;
              __IO uint8_t IRQ127MONHH;
            };
          };
        };
    };
} FM_INTREQ_TypeDef, FM4_INTREQ_TypeDef;

/*******************************************************************************
* LSCRP_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t LCR_PRSLD;
        stc_lscrp_lcr_prsld_field_t LCR_PRSLD_f;
    };
} FM_LSCRP_TypeDef, FM4_LSCRP_TypeDef;

/*******************************************************************************
* LVD_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t LVD_CTL;
        stc_lvd_lvd_ctl_field_t LVD_CTL_f;
    };
        __IO  uint8_t RESERVED0[3];
    union {
        __IO  uint8_t LVD_STR;
        stc_lvd_lvd_str_field_t LVD_STR_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO  uint8_t LVD_CLR;
        stc_lvd_lvd_clr_field_t LVD_CLR_f;
    };
        __IO  uint8_t RESERVED2[3];
    union {
        __IO uint32_t LVD_RLR;
        stc_lvd_lvd_rlr_field_t LVD_RLR_f;
        struct {
          union {
            __IO uint16_t LVD_RLRL;
            struct {
              __IO uint8_t LVD_RLRLL;
              __IO uint8_t LVD_RLRLH;
            };
          };
          union {
            __IO uint16_t LVD_RLRH;
            struct {
              __IO uint8_t LVD_RLRHL;
              __IO uint8_t LVD_RLRHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t LVD_STR2;
        stc_lvd_lvd_str2_field_t LVD_STR2_f;
    };
} FM_LVD_TypeDef, FM4_LVD_TypeDef;

