mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/common/s6e2c1xh.h
/*******************************************************************************
* PCRC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t PCRC_POLY;
        struct {
          union {
            __IO uint16_t PCRC_POLYL;
            struct {
              __IO uint8_t PCRC_POLYLL;
              __IO uint8_t PCRC_POLYLH;
            };
          };
          union {
            __IO uint16_t PCRC_POLYH;
            struct {
              __IO uint8_t PCRC_POLYHL;
              __IO uint8_t PCRC_POLYHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCRC_SEED;
        struct {
          union {
            __IO uint16_t PCRC_SEEDL;
            struct {
              __IO uint8_t PCRC_SEEDLL;
              __IO uint8_t PCRC_SEEDLH;
            };
          };
          union {
            __IO uint16_t PCRC_SEEDH;
            struct {
              __IO uint8_t PCRC_SEEDHL;
              __IO uint8_t PCRC_SEEDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCRC_FXOR;
        struct {
          union {
            __IO uint16_t PCRC_FXORL;
            struct {
              __IO uint8_t PCRC_FXORLL;
              __IO uint8_t PCRC_FXORLH;
            };
          };
          union {
            __IO uint16_t PCRC_FXORH;
            struct {
              __IO uint8_t PCRC_FXORHL;
              __IO uint8_t PCRC_FXORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCRC_CFG;
        stc_pcrc_pcrc_cfg_field_t PCRC_CFG_f;
        struct {
          union {
            __IO uint16_t PCRC_CFGL;
            struct {
              __IO uint8_t PCRC_CFGLL;
              __IO uint8_t PCRC_CFGLH;
            };
          };
          union {
            __IO uint16_t PCRC_CFGH;
            struct {
              __IO uint8_t PCRC_CFGHL;
              __IO uint8_t PCRC_CFGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCRC_WR;
        struct {
          union {
            __IO uint16_t PCRC_WRL;
            struct {
              __IO uint8_t PCRC_WRLL;
              __IO uint8_t PCRC_WRLH;
            };
          };
          union {
            __IO uint16_t PCRC_WRH;
            struct {
              __IO uint8_t PCRC_WRHL;
              __IO uint8_t PCRC_WRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PCRC_RD;
        struct {
          union {
            __IO uint16_t PCRC_RDL;
            struct {
              __IO uint8_t PCRC_RDLL;
              __IO uint8_t PCRC_RDLH;
            };
          };
          union {
            __IO uint16_t PCRC_RDH;
            struct {
              __IO uint8_t PCRC_RDHL;
              __IO uint8_t PCRC_RDHH;
            };
          };
        };
    };
} FM_PCRC_TypeDef, FM4_PCRC_TypeDef;

/*******************************************************************************
* QPRC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t QPCR;
        struct {
            __IO  uint8_t QPCRL;
            __IO  uint8_t QPCRH;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t QRCR;
        struct {
            __IO  uint8_t QRCRL;
            __IO  uint8_t QRCRH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint16_t QPCCR;
        struct {
            __IO  uint8_t QPCCRL;
            __IO  uint8_t QPCCRH;
        };
    };
        __IO  uint8_t RESERVED2[2];
    union {
        __IO uint16_t QPRCR;
        struct {
            __IO  uint8_t QPRCRL;
            __IO  uint8_t QPRCRH;
        };
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t QMPR;
        struct {
            __IO  uint8_t QMPRL;
            __IO  uint8_t QMPRH;
        };
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO  uint8_t QICRL;
        stc_qprc_qicrl_field_t QICRL_f;
    };
    union {
        __IO  uint8_t QICRH;
        stc_qprc_qicrh_field_t QICRH_f;
    };
        __IO  uint8_t RESERVED5[2];
    union {
        __IO uint16_t QCR;
        stc_qprc_qcr_field_t QCR_f;
        struct {
            __IO  uint8_t QCRL;
            __IO  uint8_t QCRH;
        };
    };
        __IO  uint8_t RESERVED6[2];
    union {
        __IO uint16_t QECR;
        stc_qprc_qecr_field_t QECR_f;
        struct {
            __IO  uint8_t QECRL;
            __IO  uint8_t QECRH;
        };
    };
        __IO  uint8_t RESERVED7[30];
    union {
        __IO uint32_t QPRCRR;
        stc_qprc_qprcrr_field_t QPRCRR_f;
        struct {
          union {
            __IO uint16_t QPRCRRL;
            struct {
              __IO uint8_t QPRCRRLL;
              __IO uint8_t QPRCRRLH;
            };
          };
          union {
            __IO uint16_t QPRCRRH;
            struct {
              __IO uint8_t QPRCRRHL;
              __IO uint8_t QPRCRRHH;
            };
          };
        };
    };
} FM_QPRC_TypeDef, FM4_QPRC_TypeDef;

/*******************************************************************************
* QPRC_NF_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t NFCTLA;
        stc_qprc_nf_nfctla_field_t NFCTLA_f;
    };
        __IO  uint8_t RESERVED0[3];
    union {
        __IO  uint8_t NFCTLB;
        stc_qprc_nf_nfctlb_field_t NFCTLB_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO  uint8_t NFCTLZ;
        stc_qprc_nf_nfctlz_field_t NFCTLZ_f;
    };
} FM_QPRC_NF_TypeDef, FM4_QPRC_NF_TypeDef;

