mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/common/s6e2c1xh.h
#define bFM_BT11_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9A20UL))
#define bFM4_BT11_PWC_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424A9A20UL))

#define bFM_BT11_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM4_BT11_PWM_STC_UDIR                    *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM_BT11_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424A9A04UL))
#define bFM4_BT11_PWM_STC_DTIR                    *((volatile  uint8_t *)(0x424A9A04UL))
#define bFM_BT11_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM4_BT11_PWM_STC_TGIR                    *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM_BT11_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM4_BT11_PWM_STC_UDIE                    *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM_BT11_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424A9A14UL))
#define bFM4_BT11_PWM_STC_DTIE                    *((volatile  uint8_t *)(0x424A9A14UL))
#define bFM_BT11_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424A9A18UL))
#define bFM4_BT11_PWM_STC_TGIE                    *((volatile  uint8_t *)(0x424A9A18UL))

#define bFM_BT11_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424A9980UL))
#define bFM4_BT11_PWM_TMCR_STRG                   *((volatile  uint8_t *)(0x424A9980UL))
#define bFM_BT11_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9984UL))
#define bFM4_BT11_PWM_TMCR_CTEN                   *((volatile  uint8_t *)(0x424A9984UL))
#define bFM_BT11_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9988UL))
#define bFM4_BT11_PWM_TMCR_MDSE                   *((volatile  uint8_t *)(0x424A9988UL))
#define bFM_BT11_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A998CUL))
#define bFM4_BT11_PWM_TMCR_OSEL                   *((volatile  uint8_t *)(0x424A998CUL))
#define bFM_BT11_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A99A8UL))
#define bFM4_BT11_PWM_TMCR_PMSK                   *((volatile  uint8_t *)(0x424A99A8UL))
#define bFM_BT11_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A99ACUL))
#define bFM4_BT11_PWM_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424A99ACUL))

#define bFM_BT11_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9A20UL))
#define bFM4_BT11_PWM_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424A9A20UL))

#define bFM_BT11_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM4_BT11_RT_STC_UDIR                     *((volatile  uint8_t *)(0x424A9A00UL))
#define bFM_BT11_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM4_BT11_RT_STC_TGIR                     *((volatile  uint8_t *)(0x424A9A08UL))
#define bFM_BT11_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM4_BT11_RT_STC_UDIE                     *((volatile  uint8_t *)(0x424A9A10UL))
#define bFM_BT11_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424A9A18UL))
#define bFM4_BT11_RT_STC_TGIE                     *((volatile  uint8_t *)(0x424A9A18UL))

#define bFM_BT11_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424A9980UL))
#define bFM4_BT11_RT_TMCR_STRG                    *((volatile  uint8_t *)(0x424A9980UL))
#define bFM_BT11_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A9984UL))
#define bFM4_BT11_RT_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A9984UL))
#define bFM_BT11_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A9988UL))
#define bFM4_BT11_RT_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A9988UL))
#define bFM_BT11_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A998CUL))
#define bFM4_BT11_RT_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A998CUL))
#define bFM_BT11_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424A999CUL))
#define bFM4_BT11_RT_TMCR_T32                     *((volatile  uint8_t *)(0x424A999CUL))

#define bFM_BT11_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A9A20UL))
#define bFM4_BT11_RT_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A9A20UL))
#define bFM_BT11_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424A9A3CUL))
#define bFM4_BT11_RT_TMCR2_GATE                   *((volatile  uint8_t *)(0x424A9A3CUL))


/*******************************************************************************
* BT Registers BT12
*   Bitband Section
*******************************************************************************/
#define bFM_BT12_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424AC200UL))
#define bFM4_BT12_PPG_STC_UDIR                    *((volatile  uint8_t *)(0x424AC200UL))
#define bFM_BT12_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424AC208UL))
#define bFM4_BT12_PPG_STC_TGIR                    *((volatile  uint8_t *)(0x424AC208UL))
#define bFM_BT12_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424AC210UL))
#define bFM4_BT12_PPG_STC_UDIE                    *((volatile  uint8_t *)(0x424AC210UL))
#define bFM_BT12_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424AC218UL))
#define bFM4_BT12_PPG_STC_TGIE                    *((volatile  uint8_t *)(0x424AC218UL))

#define bFM_BT12_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424AC180UL))
#define bFM4_BT12_PPG_TMCR_STRG                   *((volatile  uint8_t *)(0x424AC180UL))
#define bFM_BT12_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC184UL))
#define bFM4_BT12_PPG_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AC184UL))
#define bFM_BT12_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC188UL))
#define bFM4_BT12_PPG_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AC188UL))
#define bFM_BT12_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AC18CUL))
#define bFM4_BT12_PPG_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AC18CUL))
#define bFM_BT12_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AC1A8UL))
#define bFM4_BT12_PPG_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AC1A8UL))
#define bFM_BT12_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AC1ACUL))
#define bFM4_BT12_PPG_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AC1ACUL))

#define bFM_BT12_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AC220UL))
#define bFM4_BT12_PPG_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424AC220UL))

