mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/common/s6e2c1xh.h
#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P0                         *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P1                         *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P2                         *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P3                         *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM_GPIO_PFR0_P4                          *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P4                         *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM_GPIO_PFR0_P8                          *((volatile  uint8_t *)(0x42DE0020UL))
#define bFM4_GPIO_PFR0_P8                         *((volatile  uint8_t *)(0x42DE0020UL))
#define bFM_GPIO_PFR0_P9                          *((volatile  uint8_t *)(0x42DE0024UL))
#define bFM4_GPIO_PFR0_P9                         *((volatile  uint8_t *)(0x42DE0024UL))
#define bFM_GPIO_PFR0_PA                          *((volatile  uint8_t *)(0x42DE0028UL))
#define bFM4_GPIO_PFR0_PA                         *((volatile  uint8_t *)(0x42DE0028UL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P0                         *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P1                         *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P2                         *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P3                         *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM_GPIO_PFR1_P4                          *((volatile  uint8_t *)(0x42DE0090UL))
#define bFM4_GPIO_PFR1_P4                         *((volatile  uint8_t *)(0x42DE0090UL))
#define bFM_GPIO_PFR1_P5                          *((volatile  uint8_t *)(0x42DE0094UL))
#define bFM4_GPIO_PFR1_P5                         *((volatile  uint8_t *)(0x42DE0094UL))
#define bFM_GPIO_PFR1_P6                          *((volatile  uint8_t *)(0x42DE0098UL))
#define bFM4_GPIO_PFR1_P6                         *((volatile  uint8_t *)(0x42DE0098UL))
#define bFM_GPIO_PFR1_P7                          *((volatile  uint8_t *)(0x42DE009CUL))
#define bFM4_GPIO_PFR1_P7                         *((volatile  uint8_t *)(0x42DE009CUL))
#define bFM_GPIO_PFR1_P8                          *((volatile  uint8_t *)(0x42DE00A0UL))
#define bFM4_GPIO_PFR1_P8                         *((volatile  uint8_t *)(0x42DE00A0UL))
#define bFM_GPIO_PFR1_P9                          *((volatile  uint8_t *)(0x42DE00A4UL))
#define bFM4_GPIO_PFR1_P9                         *((volatile  uint8_t *)(0x42DE00A4UL))
#define bFM_GPIO_PFR1_PA                          *((volatile  uint8_t *)(0x42DE00A8UL))
#define bFM4_GPIO_PFR1_PA                         *((volatile  uint8_t *)(0x42DE00A8UL))
#define bFM_GPIO_PFR1_PB                          *((volatile  uint8_t *)(0x42DE00ACUL))
#define bFM4_GPIO_PFR1_PB                         *((volatile  uint8_t *)(0x42DE00ACUL))
#define bFM_GPIO_PFR1_PC                          *((volatile  uint8_t *)(0x42DE00B0UL))
#define bFM4_GPIO_PFR1_PC                         *((volatile  uint8_t *)(0x42DE00B0UL))
#define bFM_GPIO_PFR1_PD                          *((volatile  uint8_t *)(0x42DE00B4UL))
#define bFM4_GPIO_PFR1_PD                         *((volatile  uint8_t *)(0x42DE00B4UL))
#define bFM_GPIO_PFR1_PE                          *((volatile  uint8_t *)(0x42DE00B8UL))
#define bFM4_GPIO_PFR1_PE                         *((volatile  uint8_t *)(0x42DE00B8UL))
#define bFM_GPIO_PFR1_PF                          *((volatile  uint8_t *)(0x42DE00BCUL))
#define bFM4_GPIO_PFR1_PF                         *((volatile  uint8_t *)(0x42DE00BCUL))

#define bFM_GPIO_PFR2_P0                          *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P0                         *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM_GPIO_PFR2_P1                          *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P1                         *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P2                         *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile  uint8_t *)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P3                         *((volatile  uint8_t *)(0x42DE010CUL))
#define bFM_GPIO_PFR2_P4                          *((volatile  uint8_t *)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P4                         *((volatile  uint8_t *)(0x42DE0110UL))
#define bFM_GPIO_PFR2_P5                          *((volatile  uint8_t *)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P5                         *((volatile  uint8_t *)(0x42DE0114UL))
#define bFM_GPIO_PFR2_P6                          *((volatile  uint8_t *)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P6                         *((volatile  uint8_t *)(0x42DE0118UL))
#define bFM_GPIO_PFR2_P7                          *((volatile  uint8_t *)(0x42DE011CUL))
#define bFM4_GPIO_PFR2_P7                         *((volatile  uint8_t *)(0x42DE011CUL))
#define bFM_GPIO_PFR2_P8                          *((volatile  uint8_t *)(0x42DE0120UL))
#define bFM4_GPIO_PFR2_P8                         *((volatile  uint8_t *)(0x42DE0120UL))
#define bFM_GPIO_PFR2_P9                          *((volatile  uint8_t *)(0x42DE0124UL))
#define bFM4_GPIO_PFR2_P9                         *((volatile  uint8_t *)(0x42DE0124UL))
#define bFM_GPIO_PFR2_PA                          *((volatile  uint8_t *)(0x42DE0128UL))
#define bFM4_GPIO_PFR2_PA                         *((volatile  uint8_t *)(0x42DE0128UL))

#define bFM_GPIO_PFR3_P2                          *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P2                         *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM_GPIO_PFR3_P3                          *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P3                         *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM_GPIO_PFR3_P4                          *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P4                         *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM_GPIO_PFR3_P5                          *((volatile  uint8_t *)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P5                         *((volatile  uint8_t *)(0x42DE0194UL))
#define bFM_GPIO_PFR3_P6                          *((volatile  uint8_t *)(0x42DE0198UL))
#define bFM4_GPIO_PFR3_P6                         *((volatile  uint8_t *)(0x42DE0198UL))
#define bFM_GPIO_PFR3_P7                          *((volatile  uint8_t *)(0x42DE019CUL))
#define bFM4_GPIO_PFR3_P7                         *((volatile  uint8_t *)(0x42DE019CUL))
#define bFM_GPIO_PFR3_P8                          *((volatile  uint8_t *)(0x42DE01A0UL))
#define bFM4_GPIO_PFR3_P8                         *((volatile  uint8_t *)(0x42DE01A0UL))
#define bFM_GPIO_PFR3_P9                          *((volatile  uint8_t *)(0x42DE01A4UL))
#define bFM4_GPIO_PFR3_P9                         *((volatile  uint8_t *)(0x42DE01A4UL))
#define bFM_GPIO_PFR3_PA                          *((volatile  uint8_t *)(0x42DE01A8UL))
#define bFM4_GPIO_PFR3_PA                         *((volatile  uint8_t *)(0x42DE01A8UL))
#define bFM_GPIO_PFR3_PB                          *((volatile  uint8_t *)(0x42DE01ACUL))
#define bFM4_GPIO_PFR3_PB                         *((volatile  uint8_t *)(0x42DE01ACUL))
#define bFM_GPIO_PFR3_PC                          *((volatile  uint8_t *)(0x42DE01B0UL))
#define bFM4_GPIO_PFR3_PC                         *((volatile  uint8_t *)(0x42DE01B0UL))
#define bFM_GPIO_PFR3_PD                          *((volatile  uint8_t *)(0x42DE01B4UL))
#define bFM4_GPIO_PFR3_PD                         *((volatile  uint8_t *)(0x42DE01B4UL))
#define bFM_GPIO_PFR3_PE                          *((volatile  uint8_t *)(0x42DE01B8UL))
#define bFM4_GPIO_PFR3_PE                         *((volatile  uint8_t *)(0x42DE01B8UL))

