mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/common/s6e2c1xh.h
#define bFM_MFT1_OCU_OCSA54_CST4                  *((volatile  uint8_t *)(0x42422400UL))
#define bFM4_MFT1_OCU_OCSA54_CST4                 *((volatile  uint8_t *)(0x42422400UL))
#define bFM_MFT1_OCU_OCSA54_CST5                  *((volatile  uint8_t *)(0x42422404UL))
#define bFM4_MFT1_OCU_OCSA54_CST5                 *((volatile  uint8_t *)(0x42422404UL))
#define bFM_MFT1_OCU_OCSA54_IOE4                  *((volatile  uint8_t *)(0x42422410UL))
#define bFM4_MFT1_OCU_OCSA54_IOE4                 *((volatile  uint8_t *)(0x42422410UL))
#define bFM_MFT1_OCU_OCSA54_IOE5                  *((volatile  uint8_t *)(0x42422414UL))
#define bFM4_MFT1_OCU_OCSA54_IOE5                 *((volatile  uint8_t *)(0x42422414UL))
#define bFM_MFT1_OCU_OCSA54_IOP4                  *((volatile  uint8_t *)(0x42422418UL))
#define bFM4_MFT1_OCU_OCSA54_IOP4                 *((volatile  uint8_t *)(0x42422418UL))
#define bFM_MFT1_OCU_OCSA54_IOP5                  *((volatile  uint8_t *)(0x4242241CUL))
#define bFM4_MFT1_OCU_OCSA54_IOP5                 *((volatile  uint8_t *)(0x4242241CUL))

#define bFM_MFT1_OCU_OCSB10_OTD0                  *((volatile  uint8_t *)(0x42422320UL))
#define bFM4_MFT1_OCU_OCSB10_OTD0                 *((volatile  uint8_t *)(0x42422320UL))
#define bFM_MFT1_OCU_OCSB10_OTD1                  *((volatile  uint8_t *)(0x42422324UL))
#define bFM4_MFT1_OCU_OCSB10_OTD1                 *((volatile  uint8_t *)(0x42422324UL))
#define bFM_MFT1_OCU_OCSB10_CMOD                  *((volatile  uint8_t *)(0x42422330UL))
#define bFM4_MFT1_OCU_OCSB10_CMOD                 *((volatile  uint8_t *)(0x42422330UL))
#define bFM_MFT1_OCU_OCSB10_FM4                   *((volatile  uint8_t *)(0x4242233CUL))
#define bFM4_MFT1_OCU_OCSB10_FM4                  *((volatile  uint8_t *)(0x4242233CUL))

#define bFM_MFT1_OCU_OCSB32_OTD2                  *((volatile  uint8_t *)(0x424223A0UL))
#define bFM4_MFT1_OCU_OCSB32_OTD2                 *((volatile  uint8_t *)(0x424223A0UL))
#define bFM_MFT1_OCU_OCSB32_OTD3                  *((volatile  uint8_t *)(0x424223A4UL))
#define bFM4_MFT1_OCU_OCSB32_OTD3                 *((volatile  uint8_t *)(0x424223A4UL))
#define bFM_MFT1_OCU_OCSB32_CMOD                  *((volatile  uint8_t *)(0x424223B0UL))
#define bFM4_MFT1_OCU_OCSB32_CMOD                 *((volatile  uint8_t *)(0x424223B0UL))
#define bFM_MFT1_OCU_OCSB32_FM4                   *((volatile  uint8_t *)(0x424223BCUL))
#define bFM4_MFT1_OCU_OCSB32_FM4                  *((volatile  uint8_t *)(0x424223BCUL))

#define bFM_MFT1_OCU_OCSB54_OTD4                  *((volatile  uint8_t *)(0x42422420UL))
#define bFM4_MFT1_OCU_OCSB54_OTD4                 *((volatile  uint8_t *)(0x42422420UL))
#define bFM_MFT1_OCU_OCSB54_OTD5                  *((volatile  uint8_t *)(0x42422424UL))
#define bFM4_MFT1_OCU_OCSB54_OTD5                 *((volatile  uint8_t *)(0x42422424UL))
#define bFM_MFT1_OCU_OCSB54_CMOD                  *((volatile  uint8_t *)(0x42422430UL))
#define bFM4_MFT1_OCU_OCSB54_CMOD                 *((volatile  uint8_t *)(0x42422430UL))
#define bFM_MFT1_OCU_OCSB54_FM4                   *((volatile  uint8_t *)(0x4242243CUL))
#define bFM4_MFT1_OCU_OCSB54_FM4                  *((volatile  uint8_t *)(0x4242243CUL))

#define bFM_MFT1_OCU_OCSC_MOD0                    *((volatile  uint8_t *)(0x424224A0UL))
#define bFM4_MFT1_OCU_OCSC_MOD0                   *((volatile  uint8_t *)(0x424224A0UL))
#define bFM_MFT1_OCU_OCSC_MOD1                    *((volatile  uint8_t *)(0x424224A4UL))
#define bFM4_MFT1_OCU_OCSC_MOD1                   *((volatile  uint8_t *)(0x424224A4UL))
#define bFM_MFT1_OCU_OCSC_MOD2                    *((volatile  uint8_t *)(0x424224A8UL))
#define bFM4_MFT1_OCU_OCSC_MOD2                   *((volatile  uint8_t *)(0x424224A8UL))
#define bFM_MFT1_OCU_OCSC_MOD3                    *((volatile  uint8_t *)(0x424224ACUL))
#define bFM4_MFT1_OCU_OCSC_MOD3                   *((volatile  uint8_t *)(0x424224ACUL))
#define bFM_MFT1_OCU_OCSC_MOD4                    *((volatile  uint8_t *)(0x424224B0UL))
#define bFM4_MFT1_OCU_OCSC_MOD4                   *((volatile  uint8_t *)(0x424224B0UL))
#define bFM_MFT1_OCU_OCSC_MOD5                    *((volatile  uint8_t *)(0x424224B4UL))
#define bFM4_MFT1_OCU_OCSC_MOD5                   *((volatile  uint8_t *)(0x424224B4UL))

#define bFM_MFT1_OCU_OCSD10_OPBM0                 *((volatile  uint8_t *)(0x42422360UL))
#define bFM4_MFT1_OCU_OCSD10_OPBM0                *((volatile  uint8_t *)(0x42422360UL))
#define bFM_MFT1_OCU_OCSD10_OPBM1                 *((volatile  uint8_t *)(0x42422364UL))
#define bFM4_MFT1_OCU_OCSD10_OPBM1                *((volatile  uint8_t *)(0x42422364UL))
#define bFM_MFT1_OCU_OCSD10_OEBM0                 *((volatile  uint8_t *)(0x42422368UL))
#define bFM4_MFT1_OCU_OCSD10_OEBM0                *((volatile  uint8_t *)(0x42422368UL))
#define bFM_MFT1_OCU_OCSD10_OEBM1                 *((volatile  uint8_t *)(0x4242236CUL))
#define bFM4_MFT1_OCU_OCSD10_OEBM1                *((volatile  uint8_t *)(0x4242236CUL))
#define bFM_MFT1_OCU_OCSD10_OFEX0                 *((volatile  uint8_t *)(0x42422370UL))
#define bFM4_MFT1_OCU_OCSD10_OFEX0                *((volatile  uint8_t *)(0x42422370UL))
#define bFM_MFT1_OCU_OCSD10_OFEX1                 *((volatile  uint8_t *)(0x42422374UL))
#define bFM4_MFT1_OCU_OCSD10_OFEX1                *((volatile  uint8_t *)(0x42422374UL))

#define bFM_MFT1_OCU_OCSD32_OPBM2                 *((volatile  uint8_t *)(0x424223E0UL))
#define bFM4_MFT1_OCU_OCSD32_OPBM2                *((volatile  uint8_t *)(0x424223E0UL))
#define bFM_MFT1_OCU_OCSD32_OPBM3                 *((volatile  uint8_t *)(0x424223E4UL))
#define bFM4_MFT1_OCU_OCSD32_OPBM3                *((volatile  uint8_t *)(0x424223E4UL))
#define bFM_MFT1_OCU_OCSD32_OEBM2                 *((volatile  uint8_t *)(0x424223E8UL))
#define bFM4_MFT1_OCU_OCSD32_OEBM2                *((volatile  uint8_t *)(0x424223E8UL))
#define bFM_MFT1_OCU_OCSD32_OEBM3                 *((volatile  uint8_t *)(0x424223ECUL))
#define bFM4_MFT1_OCU_OCSD32_OEBM3                *((volatile  uint8_t *)(0x424223ECUL))
#define bFM_MFT1_OCU_OCSD32_OFEX2                 *((volatile  uint8_t *)(0x424223F0UL))
#define bFM4_MFT1_OCU_OCSD32_OFEX2                *((volatile  uint8_t *)(0x424223F0UL))
#define bFM_MFT1_OCU_OCSD32_OFEX3                 *((volatile  uint8_t *)(0x424223F4UL))
#define bFM4_MFT1_OCU_OCSD32_OFEX3                *((volatile  uint8_t *)(0x424223F4UL))

#define bFM_MFT1_OCU_OCSD54_OPBM4                 *((volatile  uint8_t *)(0x42422460UL))
#define bFM4_MFT1_OCU_OCSD54_OPBM4                *((volatile  uint8_t *)(0x42422460UL))
#define bFM_MFT1_OCU_OCSD54_OPBM5                 *((volatile  uint8_t *)(0x42422464UL))
#define bFM4_MFT1_OCU_OCSD54_OPBM5                *((volatile  uint8_t *)(0x42422464UL))
#define bFM_MFT1_OCU_OCSD54_OEBM4                 *((volatile  uint8_t *)(0x42422468UL))
#define bFM4_MFT1_OCU_OCSD54_OEBM4                *((volatile  uint8_t *)(0x42422468UL))
#define bFM_MFT1_OCU_OCSD54_OEBM5                 *((volatile  uint8_t *)(0x4242246CUL))
#define bFM4_MFT1_OCU_OCSD54_OEBM5                *((volatile  uint8_t *)(0x4242246CUL))
#define bFM_MFT1_OCU_OCSD54_OFEX4                 *((volatile  uint8_t *)(0x42422470UL))
#define bFM4_MFT1_OCU_OCSD54_OFEX4                *((volatile  uint8_t *)(0x42422470UL))
#define bFM_MFT1_OCU_OCSD54_OFEX5                 *((volatile  uint8_t *)(0x42422474UL))
#define bFM4_MFT1_OCU_OCSD54_OFEX5                *((volatile  uint8_t *)(0x42422474UL))

