mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/common/s6e2c1xh.h
#define bFM_MFT2_OCU_OCSD10_OPBM0                 *((volatile  uint8_t *)(0x42442360UL))
#define bFM4_MFT2_OCU_OCSD10_OPBM0                *((volatile  uint8_t *)(0x42442360UL))
#define bFM_MFT2_OCU_OCSD10_OPBM1                 *((volatile  uint8_t *)(0x42442364UL))
#define bFM4_MFT2_OCU_OCSD10_OPBM1                *((volatile  uint8_t *)(0x42442364UL))
#define bFM_MFT2_OCU_OCSD10_OEBM0                 *((volatile  uint8_t *)(0x42442368UL))
#define bFM4_MFT2_OCU_OCSD10_OEBM0                *((volatile  uint8_t *)(0x42442368UL))
#define bFM_MFT2_OCU_OCSD10_OEBM1                 *((volatile  uint8_t *)(0x4244236CUL))
#define bFM4_MFT2_OCU_OCSD10_OEBM1                *((volatile  uint8_t *)(0x4244236CUL))
#define bFM_MFT2_OCU_OCSD10_OFEX0                 *((volatile  uint8_t *)(0x42442370UL))
#define bFM4_MFT2_OCU_OCSD10_OFEX0                *((volatile  uint8_t *)(0x42442370UL))
#define bFM_MFT2_OCU_OCSD10_OFEX1                 *((volatile  uint8_t *)(0x42442374UL))
#define bFM4_MFT2_OCU_OCSD10_OFEX1                *((volatile  uint8_t *)(0x42442374UL))

#define bFM_MFT2_OCU_OCSD32_OPBM2                 *((volatile  uint8_t *)(0x424423E0UL))
#define bFM4_MFT2_OCU_OCSD32_OPBM2                *((volatile  uint8_t *)(0x424423E0UL))
#define bFM_MFT2_OCU_OCSD32_OPBM3                 *((volatile  uint8_t *)(0x424423E4UL))
#define bFM4_MFT2_OCU_OCSD32_OPBM3                *((volatile  uint8_t *)(0x424423E4UL))
#define bFM_MFT2_OCU_OCSD32_OEBM2                 *((volatile  uint8_t *)(0x424423E8UL))
#define bFM4_MFT2_OCU_OCSD32_OEBM2                *((volatile  uint8_t *)(0x424423E8UL))
#define bFM_MFT2_OCU_OCSD32_OEBM3                 *((volatile  uint8_t *)(0x424423ECUL))
#define bFM4_MFT2_OCU_OCSD32_OEBM3                *((volatile  uint8_t *)(0x424423ECUL))
#define bFM_MFT2_OCU_OCSD32_OFEX2                 *((volatile  uint8_t *)(0x424423F0UL))
#define bFM4_MFT2_OCU_OCSD32_OFEX2                *((volatile  uint8_t *)(0x424423F0UL))
#define bFM_MFT2_OCU_OCSD32_OFEX3                 *((volatile  uint8_t *)(0x424423F4UL))
#define bFM4_MFT2_OCU_OCSD32_OFEX3                *((volatile  uint8_t *)(0x424423F4UL))

#define bFM_MFT2_OCU_OCSD54_OPBM4                 *((volatile  uint8_t *)(0x42442460UL))
#define bFM4_MFT2_OCU_OCSD54_OPBM4                *((volatile  uint8_t *)(0x42442460UL))
#define bFM_MFT2_OCU_OCSD54_OPBM5                 *((volatile  uint8_t *)(0x42442464UL))
#define bFM4_MFT2_OCU_OCSD54_OPBM5                *((volatile  uint8_t *)(0x42442464UL))
#define bFM_MFT2_OCU_OCSD54_OEBM4                 *((volatile  uint8_t *)(0x42442468UL))
#define bFM4_MFT2_OCU_OCSD54_OEBM4                *((volatile  uint8_t *)(0x42442468UL))
#define bFM_MFT2_OCU_OCSD54_OEBM5                 *((volatile  uint8_t *)(0x4244246CUL))
#define bFM4_MFT2_OCU_OCSD54_OEBM5                *((volatile  uint8_t *)(0x4244246CUL))
#define bFM_MFT2_OCU_OCSD54_OFEX4                 *((volatile  uint8_t *)(0x42442470UL))
#define bFM4_MFT2_OCU_OCSD54_OFEX4                *((volatile  uint8_t *)(0x42442470UL))
#define bFM_MFT2_OCU_OCSD54_OFEX5                 *((volatile  uint8_t *)(0x42442474UL))
#define bFM4_MFT2_OCU_OCSD54_OFEX5                *((volatile  uint8_t *)(0x42442474UL))

#define bFM_MFT2_WFG_NZCL_DTIEA                   *((volatile  uint16_t*)(0x42443680UL))
#define bFM4_MFT2_WFG_NZCL_DTIEA                  *((volatile  uint16_t*)(0x42443680UL))
#define bFM_MFT2_WFG_NZCL_SDTI                    *((volatile  uint16_t*)(0x42443690UL))
#define bFM4_MFT2_WFG_NZCL_SDTI                   *((volatile  uint16_t*)(0x42443690UL))
#define bFM_MFT2_WFG_NZCL_DTIEB                   *((volatile  uint16_t*)(0x42443694UL))
#define bFM4_MFT2_WFG_NZCL_DTIEB                  *((volatile  uint16_t*)(0x42443694UL))
#define bFM_MFT2_WFG_NZCL_DHOLD                   *((volatile  uint16_t*)(0x4244369CUL))
#define bFM4_MFT2_WFG_NZCL_DHOLD                  *((volatile  uint16_t*)(0x4244369CUL))
#define bFM_MFT2_WFG_NZCL_DIMA                    *((volatile  uint16_t*)(0x424436A0UL))
#define bFM4_MFT2_WFG_NZCL_DIMA                   *((volatile  uint16_t*)(0x424436A0UL))
#define bFM_MFT2_WFG_NZCL_DIMB                    *((volatile  uint16_t*)(0x424436A4UL))
#define bFM4_MFT2_WFG_NZCL_DIMB                   *((volatile  uint16_t*)(0x424436A4UL))
#define bFM_MFT2_WFG_NZCL_WIM10                   *((volatile  uint16_t*)(0x424436B0UL))
#define bFM4_MFT2_WFG_NZCL_WIM10                  *((volatile  uint16_t*)(0x424436B0UL))
#define bFM_MFT2_WFG_NZCL_WIM32                   *((volatile  uint16_t*)(0x424436B4UL))
#define bFM4_MFT2_WFG_NZCL_WIM32                  *((volatile  uint16_t*)(0x424436B4UL))
#define bFM_MFT2_WFG_NZCL_WIM54                   *((volatile  uint16_t*)(0x424436B8UL))
#define bFM4_MFT2_WFG_NZCL_WIM54                  *((volatile  uint16_t*)(0x424436B8UL))

#define bFM_MFT2_WFG_WFIR_DTIFA                   *((volatile  uint16_t*)(0x42443600UL))
#define bFM4_MFT2_WFG_WFIR_DTIFA                  *((volatile  uint16_t*)(0x42443600UL))
#define bFM_MFT2_WFG_WFIR_DTICA                   *((volatile  uint16_t*)(0x42443604UL))
#define bFM4_MFT2_WFG_WFIR_DTICA                  *((volatile  uint16_t*)(0x42443604UL))
#define bFM_MFT2_WFG_WFIR_DTIFB                   *((volatile  uint16_t*)(0x42443608UL))
#define bFM4_MFT2_WFG_WFIR_DTIFB                  *((volatile  uint16_t*)(0x42443608UL))
#define bFM_MFT2_WFG_WFIR_DTICB                   *((volatile  uint16_t*)(0x4244360CUL))
#define bFM4_MFT2_WFG_WFIR_DTICB                  *((volatile  uint16_t*)(0x4244360CUL))
#define bFM_MFT2_WFG_WFIR_TMIF10                  *((volatile  uint16_t*)(0x42443610UL))
#define bFM4_MFT2_WFG_WFIR_TMIF10                 *((volatile  uint16_t*)(0x42443610UL))
#define bFM_MFT2_WFG_WFIR_TMIC10                  *((volatile  uint16_t*)(0x42443614UL))
#define bFM4_MFT2_WFG_WFIR_TMIC10                 *((volatile  uint16_t*)(0x42443614UL))
#define bFM_MFT2_WFG_WFIR_TMIE10                  *((volatile  uint16_t*)(0x42443618UL))
#define bFM4_MFT2_WFG_WFIR_TMIE10                 *((volatile  uint16_t*)(0x42443618UL))
#define bFM_MFT2_WFG_WFIR_TMIS10                  *((volatile  uint16_t*)(0x4244361CUL))
#define bFM4_MFT2_WFG_WFIR_TMIS10                 *((volatile  uint16_t*)(0x4244361CUL))
#define bFM_MFT2_WFG_WFIR_TMIF32                  *((volatile  uint16_t*)(0x42443620UL))
#define bFM4_MFT2_WFG_WFIR_TMIF32                 *((volatile  uint16_t*)(0x42443620UL))
#define bFM_MFT2_WFG_WFIR_TMIC32                  *((volatile  uint16_t*)(0x42443624UL))
#define bFM4_MFT2_WFG_WFIR_TMIC32                 *((volatile  uint16_t*)(0x42443624UL))
#define bFM_MFT2_WFG_WFIR_TMIE32                  *((volatile  uint16_t*)(0x42443628UL))
#define bFM4_MFT2_WFG_WFIR_TMIE32                 *((volatile  uint16_t*)(0x42443628UL))
#define bFM_MFT2_WFG_WFIR_TMIS32                  *((volatile  uint16_t*)(0x4244362CUL))
#define bFM4_MFT2_WFG_WFIR_TMIS32                 *((volatile  uint16_t*)(0x4244362CUL))
#define bFM_MFT2_WFG_WFIR_TMIF54                  *((volatile  uint16_t*)(0x42443630UL))
#define bFM4_MFT2_WFG_WFIR_TMIF54                 *((volatile  uint16_t*)(0x42443630UL))
#define bFM_MFT2_WFG_WFIR_TMIC54                  *((volatile  uint16_t*)(0x42443634UL))
#define bFM4_MFT2_WFG_WFIR_TMIC54                 *((volatile  uint16_t*)(0x42443634UL))
#define bFM_MFT2_WFG_WFIR_TMIE54                  *((volatile  uint16_t*)(0x42443638UL))
#define bFM4_MFT2_WFG_WFIR_TMIE54                 *((volatile  uint16_t*)(0x42443638UL))
#define bFM_MFT2_WFG_WFIR_TMIS54                  *((volatile  uint16_t*)(0x4244363CUL))
#define bFM4_MFT2_WFG_WFIR_TMIS54                 *((volatile  uint16_t*)(0x4244363CUL))


